Revit 2026 API

# ElementTransformUtils Class

---

A collection of utilities allowing transformation of elements (e.g. move, rotate, mirror and copy).

SystemObject Autodesk.Revit.DBElementTransformUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ElementTransformUtils
```
```vb
Public NotInheritable Class ElementTransformUtils
```
```cpp
public ref class ElementTransformUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ElementTransformUtils = class end
```

The ElementTransformUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanMirrorElement | Determines whether element can be mirrored. |
|  | CanMirrorElements |  |
|  | CopyElement | Copies an element and places the copy at a location indicated by a given transformation. |
|  | CopyElements(Document, ICollectionElementId, XYZ) |  |
|  | CopyElements(Document, ICollectionElementId, Document, Transform, CopyPasteOptions) |  |
|  | CopyElements(View, ICollectionElementId, View, Transform, CopyPasteOptions) |  |
|  | GetTransformFromViewToView | Returns a transformation that is applied to elements when copying from one view to another view. |
|  | MirrorElement | Creates a mirrored copy of an element about a given plane. |
|  | MirrorElements |  |
|  | MoveElement | Moves one element by a given transformation. |
|  | MoveElements |  |
|  | RotateElement | Rotates an element about the given axis and angle. |
|  | RotateElements |  |

#### Reference

Autodesk.Revit.DB Namespace